# **pymysql을 이용한 MariaDB 연동**
### connect() 함수를 이용하면 MySQL host내 mariaDB와 직접 연결할 수 있다.

###    user: user name
###    passwd: 설정한 패스워드
###    host: DB가 존재하는 host
###    db: 연결할 데이터베이스 이름
###    charset: 인코딩 설정

In [3]:
import pymysql
conn = pymysql.connect(host='database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,user='edu09',passwd='multi1234!', db='edu09db') ##3306 포트는 마리아DB의 기본설정 
print(conn)

<pymysql.connections.Connection object at 0x0000020B39ABFA60>

In [4]:
cur = conn.cursor()
print(type(cur))
print("-----------------------")
sql = 'SELECT * FROM emp'
cur.execute(sql)
result = cur.fetchall()
print(type(result))
print(result)  
#conn.close()

<class 'pymysql.cursors.Cursor'>
-----------------------
<class 'tuple'>
((7369, 'SMITH', 'CLERK', 7902, datetime.date(1980, 12, 17), 800, 0, 20), (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(1981, 2, 20), 1600, 300, 30), (7521, 'WARD', 'SALESMAN', 7698, datetime.date(1981, 2, 3), 1250, 500, 30), (7566, 'JONES', 'MANAGER', 7839, datetime.date(1981, 3, 2), 2975, 0, 20), (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(1981, 10, 22), 1250, 1400, 30), (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(1981, 5, 1), 2850, 0, 30), (7782, 'CLARK', 'MANAGER', 7839, datetime.date(1981, 9, 6), 2450, 0, 10), (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(1982, 12, 8), 3000, 0, 20), (7839, 'KING', 'PRESIDENT', 0, datetime.date(1981, 11, 17), 5000, 0, 10), (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(1984, 10, 8), 1500, 0, 30), (7876, 'ADAMS', 'CLERK', 7788, datetime.date(1983, 1, 12), 1100, 0, 20), (7900, 'JAMES', 'CLERK', 7698, datetime.date(1981, 12, 3), 950, 0, 30), (7902, 'FORD', 'ANALYST', 7566, datetime.date(1981, 12, 13), 3000, 0, 20), (7934, 'MILLER', 'CLERK', 7782, datetime.date(1982, 1, 25), 1300, 0, 10))

## Cursor 객체 생성
### 연결한 DB와 상호작용하기 위해 cursor 객체를 생성해주어야 한다.
### 다양한 커서의 종류가 있지만,
### 데이터 분석가에게 익숙한 데이터프레임 형태로 결과를 쉽게 변환할 수 있도록
### **딕셔너리** 형태로 결과를 반환해주는 **DictCursor**객체를 주로 사용한다.
### 일반 **Cursor**객체를 사용하면 결과가 일반적으로는 **튜플** 형태로 리턴된다.
----
### SELECT 명령을 위해 SQL 문을 따로 변수에 넣어주고 cursor.execute(sql) 을 사용해 SQL를 실행한다.
### 실행한 결과를 fetchall(), fetchone() 등으로 받아 온다.

### **fetchall()** - 모든 데이터를 한 번에 가져올 때 사용
### **fetchone()** - 한 번 호출에 하나의 행만 가져올 때 사용
### **fetchmany(n)** - n개만큼의 데이터를 가져올 때 사용

In [5]:
try:
    cur = conn.cursor()
    print(type(cur))
    print("-----------------------")
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchall()
    print(type(result))
    print(result)
    print("----------------------------------------------")
    print(type(result[0]))
    print(result[0])
    print("----------------------------------------------")
    print(len(result))
    print(len(result[0]))
    print("----------------------------------------------")
    for row in result:        
        print(f'{row[0]} {row[1]} {row[2]} {row[3]} {row[4]} {row[5]} {row[6]} {row[7]}')
finally:
    conn.close() #conn을 닫아버리면 그 후부터는 사용 불가, 다시 사용하려면 다시 connect부터 해야한다

<class 'pymysql.cursors.Cursor'>
-----------------------
<class 'tuple'>
((7369, 'SMITH', 'CLERK', 7902, datetime.date(1980, 12, 17), 800, 0, 20), (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(1981, 2, 20), 1600, 300, 30), (7521, 'WARD', 'SALESMAN', 7698, datetime.date(1981, 2, 3), 1250, 500, 30), (7566, 'JONES', 'MANAGER', 7839, datetime.date(1981, 3, 2), 2975, 0, 20), (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(1981, 10, 22), 1250, 1400, 30), (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(1981, 5, 1), 2850, 0, 30), (7782, 'CLARK', 'MANAGER', 7839, datetime.date(1981, 9, 6), 2450, 0, 10), (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(1982, 12, 8), 3000, 0, 20), (7839, 'KING', 'PRESIDENT', 0, datetime.date(1981, 11, 17), 5000, 0, 10), (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(1984, 10, 8), 1500, 0, 30), (7876, 'ADAMS', 'CLERK', 7788, datetime.date(1983, 1, 12), 1100, 0, 20), (7900, 'JAMES', 'CLERK', 7698, datetime.date(1981, 12, 3), 950, 0, 30), (7902, 'FORD', 'ANALYST', 7566, datetime.date(1981, 12, 13), 3000, 0, 20), (7934, 'MILLER', 'CLERK', 7782, datetime.date(1982, 1, 25), 1300, 0, 10))
----------------------------------------------
<class 'tuple'>
(7369, 'SMITH', 'CLERK', 7902, datetime.date(1980, 12, 17), 800, 0, 20)
----------------------------------------------
14
8
----------------------------------------------
7369 SMITH CLERK 7902 1980-12-17 800 0 20
7499 ALLEN SALESMAN 7698 1981-02-20 1600 300 30
7521 WARD SALESMAN 7698 1981-02-03 1250 500 30
7566 JONES MANAGER 7839 1981-03-02 2975 0 20
7654 MARTIN SALESMAN 7698 1981-10-22 1250 1400 30
7698 BLAKE MANAGER 7839 1981-05-01 2850 0 30
7782 CLARK MANAGER 7839 1981-09-06 2450 0 10
7788 SCOTT ANALYST 7566 1982-12-08 3000 0 20
7839 KING PRESIDENT 0 1981-11-17 5000 0 10
7844 TURNER SALESMAN 7698 1984-10-08 1500 0 30
7876 ADAMS CLERK 7788 1983-01-12 1100 0 20
7900 JAMES CLERK 7698 1981-12-03 950 0 30
7902 FORD ANALYST 7566 1981-12-13 3000 0 20
7934 MILLER CLERK 7782 1982-01-25 1300 0 10

In [7]:
import pandas as pd
df = pd.DataFrame(result)
df

       0       1          2     3           4     5     6   7
0   7369   SMITH      CLERK  7902  1980-12-17   800     0  20
1   7499   ALLEN   SALESMAN  7698  1981-02-20  1600   300  30
2   7521    WARD   SALESMAN  7698  1981-02-03  1250   500  30
3   7566   JONES    MANAGER  7839  1981-03-02  2975     0  20
4   7654  MARTIN   SALESMAN  7698  1981-10-22  1250  1400  30
5   7698   BLAKE    MANAGER  7839  1981-05-01  2850     0  30
6   7782   CLARK    MANAGER  7839  1981-09-06  2450     0  10
7   7788   SCOTT    ANALYST  7566  1982-12-08  3000     0  20
8   7839    KING  PRESIDENT     0  1981-11-17  5000     0  10
9   7844  TURNER   SALESMAN  7698  1984-10-08  1500     0  30
10  7876   ADAMS      CLERK  7788  1983-01-12  1100     0  20
11  7900   JAMES      CLERK  7698  1981-12-03   950     0  30
12  7902    FORD    ANALYST  7566  1981-12-13  3000     0  20
13  7934  MILLER      CLERK  7782  1982-01-25  1300     0  10

In [8]:
df = pd.DataFrame(result, columns=["empno","ename","job","mgr","hiredate","sal", "comm", "deptno"])
df

    empno   ename        job   mgr    hiredate   sal  comm  deptno
0    7369   SMITH      CLERK  7902  1980-12-17   800     0      20
1    7499   ALLEN   SALESMAN  7698  1981-02-20  1600   300      30
2    7521    WARD   SALESMAN  7698  1981-02-03  1250   500      30
3    7566   JONES    MANAGER  7839  1981-03-02  2975     0      20
4    7654  MARTIN   SALESMAN  7698  1981-10-22  1250  1400      30
5    7698   BLAKE    MANAGER  7839  1981-05-01  2850     0      30
6    7782   CLARK    MANAGER  7839  1981-09-06  2450     0      10
7    7788   SCOTT    ANALYST  7566  1982-12-08  3000     0      20
8    7839    KING  PRESIDENT     0  1981-11-17  5000     0      10
9    7844  TURNER   SALESMAN  7698  1984-10-08  1500     0      30
10   7876   ADAMS      CLERK  7788  1983-01-12  1100     0      20
11   7900   JAMES      CLERK  7698  1981-12-03   950     0      30
12   7902    FORD    ANALYST  7566  1981-12-13  3000     0      20
13   7934  MILLER      CLERK  7782  1982-01-25  1300     0      10

In [10]:
import pymysql
conn = pymysql.connect(host='database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,
                       user='edu',passwd='multi1234!', db='unicodb') #튜플로 만들어짐
try:
    cur = conn.cursor()
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchone() #첫번째줄 (one만큼  커서전진, 그렇기 때문에 후에 가져올 수 있는 것은 커서가 가리키고 있는 두번째 줄부터)
    print(type(result))
    print(result)
    print("----------------------------------------------")
    result = cur.fetchone() #두번째줄 
    print(type(result))
    print(result)
    print("----------------------------------------------")
    result = cur.fetchmany(3) #3,4,5줄
    print(type(result))
    print(result)
    print("----------------------------------------------")
    result = cur.fetchall() #모두 
    print(type(result))
    print(result)
    print("----------------------------------------------")
    result = cur.fetchone() # 더 없슈!! (위에서 모두 가져왔기 때문에 남은것이 없다.)
    print(result)
finally:
    conn.close()

<class 'tuple'>
(7369, 'SMITH', 'CLERK', 7902, datetime.date(1980, 12, 17), 800, 0, 20)
----------------------------------------------
<class 'tuple'>
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(1981, 2, 20), 1600, 300, 30)
----------------------------------------------
<class 'tuple'>
((7521, 'WARD', 'SALESMAN', 7698, datetime.date(1981, 2, 3), 1250, 500, 30), (7566, 'JONES', 'MANAGER', 7839, datetime.date(1981, 3, 2), 2975, 0, 20), (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(1981, 10, 22), 1250, 1400, 30))
----------------------------------------------
<class 'tuple'>
((7698, 'BLAKE', 'MANAGER', 7839, datetime.date(1981, 5, 1), 2850, 0, 30), (7782, 'CLARK', 'MANAGER', 7839, datetime.date(1981, 9, 6), 2450, 0, 10), (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(1982, 12, 8), 3000, 0, 20), (7839, 'KING', 'PRESIDENT', 0, datetime.date(1981, 11, 17), 5000, 0, 10), (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(1984, 10, 8), 1500, 0, 30), (7876, 'ADAMS', 'CLERK', 7788, datetime.date(1983, 1, 12), 1100, 0, 20), (7900, 'JAMES', 'CLERK', 7698, datetime.date(1981, 12, 3), 950, 0, 30), (7902, 'FORD', 'ANALYST', 7566, datetime.date(1981, 12, 13), 3000, 0, 20), (7934, 'MILLER', 'CLERK', 7782, datetime.date(1982, 1, 25), 1300, 0, 10))
----------------------------------------------
None

In [11]:
import pymysql
conn = pymysql.connect(host='database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,
                       user='edu',passwd='multi1234!', db='unicodb', cursorclass=pymysql.cursors.DictCursor)#딕셔너리 컨넥 튜플과 달리 colunms이 딸려옴 ! 
try:
    cur = conn.cursor()
    print(type(cur))
    print("-----------------------")
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchall()
    print(type(result))
    print(result)
    print("----------------------------------------------")
    print(type(result[0]))
    print(result[0])
    print("----------------------------------------------")
    print(len(result))
    print(len(result[0]))
    print("----------------------------------------------")
    for row in result:        
        print(f'{row["empno"]} {row["ename"]} {row["job"]} {row["mgr"]} {row["hiredate"]} {row["sal"]} {row["comm"]} {row["deptno"]}')
finally:
    conn.close()

<class 'pymysql.cursors.DictCursor'>
-----------------------
<class 'list'>
[{'empno': 7369, 'ename': 'SMITH', 'job': 'CLERK', 'mgr': 7902, 'hiredate': datetime.date(1980, 12, 17), 'sal': 800, 'comm': 0, 'deptno': 20}, {'empno': 7499, 'ename': 'ALLEN', 'job': 'SALESMAN', 'mgr': 7698, 'hiredate': datetime.date(1981, 2, 20), 'sal': 1600, 'comm': 300, 'deptno': 30}, {'empno': 7521, 'ename': 'WARD', 'job': 'SALESMAN', 'mgr': 7698, 'hiredate': datetime.date(1981, 2, 3), 'sal': 1250, 'comm': 500, 'deptno': 30}, {'empno': 7566, 'ename': 'JONES', 'job': 'MANAGER', 'mgr': 7839, 'hiredate': datetime.date(1981, 3, 2), 'sal': 2975, 'comm': 0, 'deptno': 20}, {'empno': 7654, 'ename': 'MARTIN', 'job': 'SALESMAN', 'mgr': 7698, 'hiredate': datetime.date(1981, 10, 22), 'sal': 1250, 'comm': 1400, 'deptno': 30}, {'empno': 7698, 'ename': 'BLAKE', 'job': 'MANAGER', 'mgr': 7839, 'hiredate': datetime.date(1981, 5, 1), 'sal': 2850, 'comm': 0, 'deptno': 30}, {'empno': 7782, 'ename': 'CLARK', 'job': 'MANAGER', 'mgr': 7839, 'hiredate': datetime.date(1981, 9, 6), 'sal': 2450, 'comm': 0, 'deptno': 10}, {'empno': 7788, 'ename': 'SCOTT', 'job': 'ANALYST', 'mgr': 7566, 'hiredate': datetime.date(1982, 12, 8), 'sal': 3000, 'comm': 0, 'deptno': 20}, {'empno': 7839, 'ename': 'KING', 'job': 'PRESIDENT', 'mgr': 0, 'hiredate': datetime.date(1981, 11, 17), 'sal': 5000, 'comm': 0, 'deptno': 10}, {'empno': 7844, 'ename': 'TURNER', 'job': 'SALESMAN', 'mgr': 7698, 'hiredate': datetime.date(1984, 10, 8), 'sal': 1500, 'comm': 0, 'deptno': 30}, {'empno': 7876, 'ename': 'ADAMS', 'job': 'CLERK', 'mgr': 7788, 'hiredate': datetime.date(1983, 1, 12), 'sal': 1100, 'comm': 0, 'deptno': 20}, {'empno': 7900, 'ename': 'JAMES', 'job': 'CLERK', 'mgr': 7698, 'hiredate': datetime.date(1981, 12, 3), 'sal': 950, 'comm': 0, 'deptno': 30}, {'empno': 7902, 'ename': 'FORD', 'job': 'ANALYST', 'mgr': 7566, 'hiredate': datetime.date(1981, 12, 13), 'sal': 3000, 'comm': 0, 'deptno': 20}, {'empno': 7934, 'ename': 'MILLER', 'job': 'CLERK', 'mgr': 7782, 'hiredate': datetime.date(1982, 1, 25), 'sal': 1300, 'comm': 0, 'deptno': 10}]
----------------------------------------------
<class 'dict'>
{'empno': 7369, 'ename': 'SMITH', 'job': 'CLERK', 'mgr': 7902, 'hiredate': datetime.date(1980, 12, 17), 'sal': 800, 'comm': 0, 'deptno': 20}
----------------------------------------------
14
8
----------------------------------------------
7369 SMITH CLERK 7902 1980-12-17 800 0 20
7499 ALLEN SALESMAN 7698 1981-02-20 1600 300 30
7521 WARD SALESMAN 7698 1981-02-03 1250 500 30
7566 JONES MANAGER 7839 1981-03-02 2975 0 20
7654 MARTIN SALESMAN 7698 1981-10-22 1250 1400 30
7698 BLAKE MANAGER 7839 1981-05-01 2850 0 30
7782 CLARK MANAGER 7839 1981-09-06 2450 0 10
7788 SCOTT ANALYST 7566 1982-12-08 3000 0 20
7839 KING PRESIDENT 0 1981-11-17 5000 0 10
7844 TURNER SALESMAN 7698 1984-10-08 1500 0 30
7876 ADAMS CLERK 7788 1983-01-12 1100 0 20
7900 JAMES CLERK 7698 1981-12-03 950 0 30
7902 FORD ANALYST 7566 1981-12-13 3000 0 20
7934 MILLER CLERK 7782 1982-01-25 1300 0 10

In [12]:
import pandas as pd

In [13]:
df = pd.DataFrame(result)
df

    empno   ename        job   mgr    hiredate   sal  comm  deptno
0    7369   SMITH      CLERK  7902  1980-12-17   800     0      20
1    7499   ALLEN   SALESMAN  7698  1981-02-20  1600   300      30
2    7521    WARD   SALESMAN  7698  1981-02-03  1250   500      30
3    7566   JONES    MANAGER  7839  1981-03-02  2975     0      20
4    7654  MARTIN   SALESMAN  7698  1981-10-22  1250  1400      30
5    7698   BLAKE    MANAGER  7839  1981-05-01  2850     0      30
6    7782   CLARK    MANAGER  7839  1981-09-06  2450     0      10
7    7788   SCOTT    ANALYST  7566  1982-12-08  3000     0      20
8    7839    KING  PRESIDENT     0  1981-11-17  5000     0      10
9    7844  TURNER   SALESMAN  7698  1984-10-08  1500     0      30
10   7876   ADAMS      CLERK  7788  1983-01-12  1100     0      20
11   7900   JAMES      CLERK  7698  1981-12-03   950     0      30
12   7902    FORD    ANALYST  7566  1981-12-13  3000     0      20
13   7934  MILLER      CLERK  7782  1982-01-25  1300     0      10

In [ ]:
import pymysql
conn = pymysql.connect(host='database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,
                       user='edu',passwd='multi1234!', db='unicodb', cursorclass=pymysql.cursors.DictCursor)
try:
    cur = conn.cursor()
    print(type(cur))
    print("-----------------------")
    sql = 'SELECT * FROM emp where deptno = 30 order by sal desc'
    cur.execute(sql)
    result = cur.fetchall()
    print(type(result))
    print(result)
    print("----------------------------------------------")
    print(type(result[0]))
    print(result[0])
    print("----------------------------------------------")
    print(len(result))
    print(len(result[0]))
    print("----------------------------------------------")
    for row in result:        
        print(f'{row["empno"]} {row["ename"]} {row["job"]} {row["mgr"]} {row["hiredate"]} {row["sal"]} {row["comm"]} {row["deptno"]}')
finally:
    conn.close()

In [ ]:
df2 = pd.DataFrame(result)
df2

In [ ]:
import pymysql

dbServerName    = "database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com"
dbUser          = "edu"
dbPassword      = "multi1234!"
dbName          = "unicodb"
charSet         = "utf8"
cusrorType      = pymysql.cursors.DictCursor

connectionObject   = pymysql.connect(host=dbServerName, user=dbUser, password=dbPassword,
                                     db=dbName, charset=charSet,cursorclass=cusrorType)

try:
    cursorObject = connectionObject.cursor()                                     
    sqlQuery = "CREATE TABLE IF NOT EXISTS friend(id int, LastName varchar(32), FirstName varchar(32), DepartmentCode int)"   
    cursorObject.execute(sqlQuery)
    sqlQuery = "show tables"   
    cursorObject.execute(sqlQuery)
    rows = cursorObject.fetchall()
    for row in rows:
        print(row)

    insertStatement = "INSERT INTO friend (id, LastName, FirstName, DepartmentCode) VALUES (1,'KIM','JUNGHYUN',10)"   
    cursorObject.execute(insertStatement)
    insertStatement = "INSERT INTO friend (id, LastName, FirstName, DepartmentCode) VALUES (1,'GO','GILDONG',10)"   
    cursorObject.execute(insertStatement)
    insertStatement = "INSERT INTO friend (id, LastName, FirstName, DepartmentCode) VALUES (3,'GO','HEEDONG',20)"   
    cursorObject.execute(insertStatement)
    connectionObject.commit()

    sqlQuery = "select * from friend"   
    cursorObject.execute(sqlQuery)
    rows = cursorObject.fetchall()

    for row in rows:
        print(row)

except Exception as e:
    print("Exeception occured:{}".format(e))
finally:    
    connectionObject.close()

In [28]:
import pymysql
conn = pymysql.connect(host='database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,user='edu',passwd='multi1234!', db='unicodb')
try:
    cur = conn.cursor()
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchall()
    print(result)
    print("----------------------------------------------")
    sql = 'SELECT * FROM friend'
    cur.execute(sql)
    result = cur.fetchall()
    print(result)   
finally:
    conn.close()

((7369, 'SMITH', 'CLERK', 7902, datetime.date(1980, 12, 17), 800, 0, 20), (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(1981, 2, 20), 1600, 300, 30), (7521, 'WARD', 'SALESMAN', 7698, datetime.date(1981, 2, 3), 1250, 500, 30), (7566, 'JONES', 'MANAGER', 7839, datetime.date(1981, 3, 2), 2975, 0, 20), (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(1981, 10, 22), 1250, 1400, 30), (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(1981, 5, 1), 2850, 0, 30), (7782, 'CLARK', 'MANAGER', 7839, datetime.date(1981, 9, 6), 2450, 0, 10), (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(1982, 12, 8), 3000, 0, 20), (7839, 'KING', 'PRESIDENT', 0, datetime.date(1981, 11, 17), 5000, 0, 10), (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(1984, 10, 8), 1500, 0, 30), (7876, 'ADAMS', 'CLERK', 7788, datetime.date(1983, 1, 12), 1100, 0, 20), (7900, 'JAMES', 'CLERK', 7698, datetime.date(1981, 12, 3), 950, 0, 30), (7902, 'FORD', 'ANALYST', 7566, datetime.date(1981, 12, 13), 3000, 0, 20), (7934, 'MILLER', 'CLERK', 7782, datetime.date(1982, 1, 25), 1300, 0, 10), (1234, 'aaa', 'bbb', None, datetime.date(2021, 4, 1), 1000, 0, 10))
----------------------------------------------
((1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (3, 'GO', 'HEEDONG', 20))